class UpdateAllTelegramUsers < ActiveRecord::Migration[7.2]
  def up
    list_of_name = %w[Олександр Володимир Дмитро Андрій Сергій Василь Микола Юрій Петро Іван Богдан Тарас Олег Артем Максим Роман Віталій Павло Олексій Ігор Анатолій Віктор Ярослав Валентин Леонід Ростислав Вадим Станіслав Михайло Кирило Денис Степан Григорій Олексій Арсеній Борис Владислав Данило Остап Федір Ілля Назар Святослав В'ячеслав Артур Валерій Марко Тимур Зіновій Олена Катерина Анастасія Юлія Марія Наталія Тетяна Ольга Вікторія Ірина Анна Яна Дарія Ярослава Софія Валерія Вероніка Оксана Лариса Олександра Поліна Діана Людмила Віра Надія Аліна Христина Інна Каріна Маргарита Марина Іванна Софія Маріанна Валентина Галина Лілія Мілана Соломія Владислава Злата Ліна Настя Маргарита Ксенія Вікторія]
    list_of_surname = %w[Коваль Коваленко Бондар Бондаренко Шевченко Мороз Морозенко Кравченко Кравець Савченко Іваненко Петренко Олійник Руденко Гриценко Тимченко Дмитренко Лисенко Сидоренко Павленко Марченко Вовк Мельник Ткач Ткаченко Кузьменко Антоненко Литвин Ярошенко Богданенко Гнатенко Шаповал Коцюбинський Поліщук Чорний Сірий Білий Зеленський Голуб Орел Соколенко Бережний Зозуля Лебідь Степаненко Остапенко Миколайчук Назаренко Романенко Яковенко Гончар Гончаренко Пономаренко Сокол Король Півень Хоменко Дяченко Юрченко Зінченко Овчаренко Писаренко Василенко Федоренко Артеменко Іщенко Кириленко Клименко Зубенко Матвієнко Панченко Рудь Семененко Тарасенко Шевчук Черненко Шевцов Бондарчук Бабенко Скакун Паляничка Зайченко Гайдай Литвиненко Борисенко Коляда Чумак Огородник Вернигора Хмарук Гавриленко Радченко Черкас Поляков Палій Яременко Воробей Барабаш Свириденко Лугова Лозовий Дорошенко Ревенко Тесля Коломієць Журавель Слюсар Цимбалюк Гайовий Сірко Осадчий Захарчук Кривенко Чорнобай Рогач Рябко Дерев’янко]

    User.all.each do |user|
      name = list_of_name.sample
      surname = list_of_surname.sample

      transliterated_name = Translit.convert(name).downcase
      transliterated_surname = Translit.convert(surname).downcase

      base_username = "#{transliterated_name}_#{transliterated_surname}"

      sanitized_username = base_username.gsub(/[^a-z0-9_]/, '_').gsub(/_{2,}/, '_').gsub(/^_+|_+$/, '')

      unique_username = sanitized_username
      counter = 1
      while Telegram.exists?(username: unique_username)
        unique_username = "#{sanitized_username}_#{counter}"
        counter += 1
      end

      Telegram.create!(
        name: name,
        surname: surname,
        username: unique_username,
        phone: user.card_number.number,
        email: user.card_number.email,
        user_id: user.id
      )
    end
  end

  def down
    Telegram.destroy_all
  end
end
